;G0 X15 Y15 F9000  ; Go to front
;G0 Z0.15 		   ; Drop to bed
;G92 E0 			; zero the extruded length
;G1 X20 E10 F500  ; Extrude 10mm of filament in a 4cm line1
;G92 E0 			; zero the extruded length
;G1 E-1 F500 	   ; Retract a little
;G1 X80 F4000 	   ; Quickly wipe away from the filament line
;G1 Z0.3 		   ; Raise and begin printing.
;Put printing message on LCD screen
;M117 Printing...

G21        			; метрические единицы измерения
G90        			; переходим в абсолютную систему координат
M82        			; set extruder to absolute mode
M107       			; начинаем печать с выключеным кулером
G28 X0 Y0 			; команда HOME для X и Y
G28 Z0 				; команда HOME для Z
G92        			; сбросит все координаты осей на ноль
G90 				; переходим в абсолютную систему координат
G1 Z5 F1000 		; движение вверх на 5 мм на скорости 1000
G1 X10 Y10 			; движение в левый нижний угол стола
G1 Z0 				; движение вниз в ноль
G4 S15 				; пауза 15 секунд
G1 Z5 				; движение вверх на 5 мм
G1 X10 Y210 		; движение в правый нижний угол стола
G1 Z0 				; движение вниз в ноль
G4 S15 				; пауза 15 секунд
G1 Z5 				; движение вверх на 5 мм
G1 X210 Y210		; движение в правый верхний угол стола
G1 Z0 				; движение вниз в ноль
G4 S15 				; пауза 15 секунд
G1 Z5 				; движение вверх на 5 мм
G1 X210 Y10 		; движение в левый верхний угол стола
G1 Z0				; движение вниз в ноль
G4 S15 				; пауза 15 секунд
G1 Z5				; движение вверх на 5 мм
G1 X110 Y110 		; движение в середину стола
G1 Z0 				; движение вниз в ноль
G4 S15 				; пауза 15 секунд
M300 S5000 P280 	; звуковой сигнал, S - длительность, P - частота
G1 Z5 				; движение вверх на 5 мм
G28 X0 Y0 			; команда HOME для X и Y
G28 Z0 				; команда HOME для Z
G92        			; сбросит все координаты осей на ноль
G90 				; переходим в абсолютную систему координат
G91 				; переходим в относительную систему координат
G92 E0 				; обнуление координат пластика (длины)
G1 E3 F300 			; выдавить 3 мм пластика на подаче 300
M117 Printing...	; сообщение на экран